HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/App/App_Motor_Project.c
        Sensor_Config_t sensorCurrentCfg = {
            .u8AdcDevId = ID_ADC_CURRENT,
            
            .s32OvercurrentThresholdMa = s32ThresholdMa,
            .s32OvercurrentHysteresisMa = s32HysteresisMa,
            
            .u8OvercurrentMode = OVERCURRENT_MODE_TIME_WINDOW,  //     ? ? ?  ?  ??
            
            //     ??   ? ?  ?? 2 ? ? 
            .u16TriggerWindowSize = 0,
            .u16ReleaseWindowSize = 0,
            
            // ?  ??    
            .u32TriggerWindowMs = u32TriggerMs,
            .u32ReleaseWindowMs = u32ReleaseMs,
        };
        g_sensor_current_dev = Sensor_Device_Create(&sensorCurrentCfg);
        DeviceManager_Register(ID_SENSOR_CURRENT, "SensorCurrent", DEVICE_TYPE_SENSOR,
                            g_sensor_current_dev, g_sensor_ops);
    }

    // ?  ?  ?       ��
    RTurn_Config_t rturnCfg = {
        .u8MotorHallDevId = ID_MOTOR_HALL,                      //  ??       ��
        .u8MotorArbiterDevId = ID_MOTOR,                        //        ??   ?             
        .u8SensorDevId = ID_SENSOR_CURRENT,                     //  ??          ��
        .fReductionRatio = (float)g_AppParam.rturn_reduction_ratio / 10.0f,  //   Flash  ?    ? 
        .fMaxAngle = (float)g_AppParam.open_limit_angle / 10.0f,                           //    ? 
        .fMinAngle = (float)g_AppParam.close_limit_angle / 10.0f,                           //   �� ? 
        .u8ReverseOutput = RTURN_REVERSE_OUTPUT,                //           ?
        .u8DeviceId = ID_RTURN,
        .u16UpdateIntervalMs = RTURN_UPDATE_INTERVAL_MS         //    ?  
    };

    // RTurn_Device_t* rturn_dev = RTurn_Device_Create(&rturnCfg);
    g_rturn_dev = RTurn_Device_Create(&rturnCfg);
    DeviceManager_Register(ID_RTURN, "RTurn", DEVICE_TYPE_SENSOR, 
                        g_rturn_dev, g_rturn_ops);


                        
}

// ========== EventBus ???????? ==========
static void SetupEventBusSubscriptions(void) {
    //     ��   ?    ??  ?     ? 0       ?     ?      
    EventBus_Subscribe(TOPIC_POWER, Motor_OnPowerEvent, 0);
    EventBus_Subscribe(TOPIC_LIMIT_HARD, Motor_OnHardLimit, 0);
    EventBus_Subscribe(TOPIC_LIMIT_SOFT, Motor_OnHardLimit, 0);
    EventBus_Subscribe(TOPIC_MANUAL_IO, Motor_OnManualIO, 0);
    EventBus_Subscribe(TOPIC_MOTOR_SPEED_FEEDBACK, Motor_OnSpeedFeedback, 0);    
    //        ��   ?    ? 
    EventBus_Subscribe(TOPIC_ALARM, Motor_OnOvercurrent, 0);
    EventBus_Subscribe(TOPIC_VOLTAGE_ALARM, Motor_OnVoltageAlarm, 0);
    // ?  ?         ?    ? 
    EventBus_Subscribe(TOPIC_CURRENT_ALARM, RTurn_OnCurrentAlarm, 1);	
    EventBus_Subscribe(TOPIC_CURRENT_ALARM, Motor_OnCurrentAlarm, 1);

    //     ?       ?  ?        �� ? 
    EventBus_Subscribe(TOPIC_RTURN_LIMIT, Motor_OnRTurnLimit, 0);
    // RS485  ?    ? ?   Modbus REG_CTRL_CMD       
    EventBus_Subscribe(TOPIC_MANUAL_RS485, Motor_OnManualIO, 0);
}

// ==========       ??  D??  ?  ???? ==========
static void SetDeviceUpdateIntervals(void) {
    DeviceManager_SetUpdateInterval(ID_PWR_POS, 1);
    DeviceManager_SetUpdateInterval(ID_PWR_NEG, 1);
    // ????      ? -     ???a0  ???  ????  D? (  ?  )
    // DeviceManager_SetUpdateInterval(ID_HALL_UP, 1);    //   ??T??
    // DeviceManager_SetUpdateInterval(ID_HALL_DOWN, 1);  // ???T??
    // DeviceManager_SetUpdateInterval(ID_IO_FWD, 1000);
    // DeviceManager_SetUpdateInterval(ID_IO_REV, 1000);
    // DeviceManager_SetUpdateInterval(ID_PWM_MOTOR, 10000);
    DeviceManager_SetUpdateInterval(ID_MOTOR, 1);
    DeviceManager_SetUpdateInterval(ID_MOTOR_HALL, 1);  // ?10ms    
    //    SetDeviceUpdateIntervals           
    DeviceManager_SetUpdateInterval(ID_ADC_CURRENT, 0);   // ADC        
    DeviceManager_SetUpdateInterval(ID_ADC_VOLTAGE, 1);   // ADC  ?    
    
    //   ?? ??          �� - ?10ms  ADC  ?      ?  
    DeviceManager_SetUpdateInterval(ID_VOLTAGE_BUS, 10);   // ?10ms    ?  ? ? ?
    DeviceManager_SetUpdateInterval(ID_SENSOR_CURRENT, 0); // ?10ms    ? ��   ?
    DeviceManager_SetUpdateInterval(ID_RTURN, 1);  // ?10ms    ? ��? 
}

// ========== ?  ?a? ? |     ==========
#if ENABLE_SIMULATION_MODE

void Sim_ProcessInput(void) {
    static uint32_t last_update = 0;
    uint32_t now = tickTimer_GetCount();
    
    if (now - last_update < 100) return;
    last_update = now;
}

void Sim_PublishEvents(void) {
    uint32_t now = tickTimer_GetCount();
    (void)now;  //     ��? t   
    
    //   ? ? 
    static uint8_t last_pwr_pos = 0;
    static uint8_t last_pwr_neg = 0;
    
    if (g_sim.sim_pwr_pos != last_pwr_pos) {
        MotorPowerEvent_t pwrEvent = {.power_id = 0, .is_on = (g_sim.sim_pwr_pos != 0)};
        EventBus_Publish(TOPIC_POWER, &pwrEvent);
        MAIN_D("[SIM] POWER_POS changed: %d -> %d\r\n", last_pwr_pos, g_sim.sim_pwr_pos);
        last_pwr_pos = g_sim.sim_pwr_pos;
    }
    
    if (g_sim.sim_pwr_neg != last_pwr_neg) {
        MotorPowerEvent_t pwrEvent = {.power_id = 1, .is_on = (g_sim.sim_pwr_neg != 0)};
        EventBus_Publish(TOPIC_POWER, &pwrEvent);
        MAIN_D("[SIM] POWER_NEG changed: %d -> %d\r\n", last_pwr_neg, g_sim.sim_pwr_neg);
        last_pwr_neg = g_sim.sim_pwr_neg;
    }
    
    //   �� ? 
    static uint8_t last_hall_up = 0;
    static uint8_t last_hall_down = 0;
    
    if (g_sim.sim_hall_up != last_hall_up) {
        MotorLimitEvent_t limitEvent = {.dir = DIR_FWD, .is_active = (g_sim.sim_hall_up != 0)};
        EventBus_Publish(TOPIC_LIMIT_HARD, &limitEvent);
        MAIN_D("[SIM] HALL_UP changed: %d -> %d\r\n", last_hall_up, g_sim.sim_hall_up);
        last_hall_up = g_sim.sim_hall_up;
    }
    
    if (g_sim.sim_hall_down != last_hall_down) {
        MotorLimitEvent_t limitEvent = {.dir = DIR_REV, .is_active = (g_sim.sim_hall_down != 0)};
        EventBus_Publish(TOPIC_LIMIT_HARD, &limitEvent);
        MAIN_D("[SIM] HALL_DOWN changed: %d -> %d\r\n", last_hall_down, g_sim.sim_hall_down);
        last_hall_down = g_sim.sim_hall_down;
    }
    
    // IO ?  - ?   �ҁ�?  ?
    static uint8_t last_io_fwd = 0;
    static uint8_t last_io_rev = 0;
    
    //   ?IO ��   
    if (g_sim.sim_io_fwd != last_io_fwd) {
        MAIN_D("[SIM] IO_FWD changed: %d -> %d\r\n", last_io_fwd, g_sim.sim_io_fwd);
        
        MotorManualIOEvent_t ioEvent;
        memset(&ioEvent, 0, sizeof(MotorManualIOEvent_t));  //   ?       ? 
        
        if (g_sim.sim_io_fwd) {
            ioEvent.dir = DIR_FWD;
            ioEvent.type = CMD_TYPE_RUN_FWD;
            ioEvent.speed = g_sim.sim_io_speed;
        } else {
            ioEvent.dir = DIR_FWD;
            ioEvent.type = CMD_TYPE_STOP;
            ioEvent.speed = 0.0f;
        }
        
