HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/App/App_Motor_Project.c
        MAIN_D("[RELOAD] Current: threshold=%ld mA, trigger=%lu ms, release=%lu ms\r\n",
               (long)g_sensor_current_dev->stcConfig.s32OvercurrentThresholdMa,
               (unsigned long)g_sensor_current_dev->stcConfig.u32TriggerWindowMs,
               (unsigned long)g_sensor_current_dev->stcConfig.u32ReleaseWindowMs);
    }

    /* --- ?  / ? ?  ?? ?  g_AppParam   ?           --- */
    /* ---  ��  ? (node_id)   ��   Flash   ��  Param_Init ?  �� --- */


    /* ---    ? :     RTurn �� --- */
    if (g_rturn_dev != NULL)
    {
        g_rturn_dev->stcConfig.fReductionRatio =
            (float)g_AppParam.rturn_reduction_ratio / 10.0f;
        g_rturn_dev->stcConfig.fMaxAngle =
            (float)g_AppParam.open_limit_angle / 10.0f;
        g_rturn_dev->stcConfig.fMinAngle =
            (float)g_AppParam.close_limit_angle / 10.0f;
        MAIN_D("[RELOAD] Reduction ratio: %.1f, MaxAngle: %.1f, MinAngle: %.1f\r\n",
               (double)g_rturn_dev->stcConfig.fReductionRatio,
               (double)g_rturn_dev->stcConfig.fMaxAngle,
               (double)g_rturn_dev->stcConfig.fMinAngle);
    }

    /* ---          :     MotorHall �� --- */
    if (g_motor_hall_dev != NULL && g_motor_hall_dev->handle != NULL)
    {
        motor_hall_set_pole_pairs(g_motor_hall_dev->handle,
                                  (uint8_t)g_AppParam.motor_hall_pole_pairs);
        g_motor_hall_dev->config.pole_pairs =
            (uint8_t)g_AppParam.motor_hall_pole_pairs;
        MAIN_D("[RELOAD] Pole pairs: %d\r\n",
               (int)g_AppParam.motor_hall_pole_pairs);
    }

    MAIN_D("[RELOAD] Config reload complete.\r\n");
}


void ESystem_MainLoop(void) {
    static uint32_t last_loop_time = 0;
    uint32_t now = tickTimer_GetCount();
    
    if (now - last_loop_time < 1) return;
    last_loop_time = now;
    
#if ENABLE_SIMULATION_MODE
    Sim_ProcessInput();
    Sim_PublishEvents();
#endif
    
    ProcessDeviceUpdates();
    RunAngle_Update();         /* Track absolute angle from Hall pulse delta */
    UpdateStatusIndicators();
}
